[
    {
        "title": "Inside Out 2",
        "genre": "Animation",
        "plot": "Teenager Riley's mind headquarters is undergoing a sudden demolition to make room for something entirely unexpected: new Emotions! Joy, Sadness, Anger, Fear and Disgust, who’ve long been running a successful operation by all accounts, aren’t sure how to feel when Anxiety shows up. And it looks like she’s not alone."
    },
    {
        "title": "Despicable Me 4",
        "genre": "Animation",
        "plot": "Gru and Lucy and their girls — Margo, Edith and Agnes — welcome a new member to the Gru family, Gru Jr., who is intent on tormenting his dad. Meanwhile, Gru faces a new nemesis in Maxime Le Mal and his femme fatale girlfriend Valentina, forcing the family to go on the run."
    },
    {
        "title": "The Garfield Movie",
        "genre": "Animation",
        "plot": "Garfield, the world-famous, Monday-hating, lasagna-loving indoor cat, is about to have a wild outdoor adventure! After an unexpected reunion with his long-lost father – scruffy street cat Vic – Garfield and his canine friend Odie are forced from their perfectly pampered life into joining Vic in a hilarious, high-stakes heist."
    },
    {
        "title": "Furiosa: A Mad Max Saga",
        "genre": "Action",
        "plot": "As the world fell, young Furiosa is snatched from the Green Place of Many Mothers and falls into the hands of a great Biker Horde led by the Warlord Dementus. Sweeping through the Wasteland they come across the Citadel presided over by The Immortan Joe. While the two Tyrants war for dominance, Furiosa must survive many trials as she puts together the means to find her way home."
    },
    {
        "title": "Kingdom of the Planet of the Apes",
        "genre": "Science Fiction",
        "plot": "Several generations following Caesar's reign, apes – now the dominant species – live harmoniously while humans have been reduced to living in the shadows. As a new tyrannical ape leader builds his empire, one young ape undertakes a harrowing journey that will cause him to question all he's known about the past and to make choices that will define a future for apes and humans alike."
    },
    {
        "title": "Descendants: The Rise of Red",
        "genre": "Fantasy",
        "plot": "After the Queen of Hearts incites a coup on Auradon, her rebellious daughter Red and Cinderella's perfectionist daughter Chloe join forces and travel back in time to try to undo the traumatic event that set Red's mother down her villainous path."
    },
    {
        "title": "Bad Boys: Ride or Die",
        "genre": "Action",
        "plot": "After their late former Captain is framed, Lowrey and Burnett try to clear his name, only to end up on the run themselves."
    },
    {
        "title": "Beverly Hills Cop: Axel F",
        "genre": "Action",
        "plot": "Forty years after his unforgettable first case in Beverly Hills, Detroit cop Axel Foley returns to do what he does best: solve crimes and cause chaos."
    },
    {
        "title": "Monkey Man",
        "genre": "Action",
        "plot": "Kid is an anonymous young man who ekes out a meager living in an underground fight club where, night after night, wearing a gorilla mask, he is beaten bloody by more popular fighters for cash. After years of suppressed rage, Kid discovers a way to infiltrate the enclave of the city’s sinister elite. As his childhood trauma boils over, his mysteriously scarred hands unleash an explosive campaign of retribution to settle the score with the men who took everything from him."
    },
    {
        "title": "The Exorcism",
        "genre": "Horror",
        "plot": "A troubled actor begins to unravel while shooting a supernatural horror film, leading his estranged daughter to wonder if he's slipping back into his past addictions or if there's something more sinister at play."
    },
    {
        "title": "Godzilla x Kong: The New Empire",
        "genre": "Science Fiction",
        "plot": "Following their explosive showdown, Godzilla and Kong must reunite against a colossal undiscovered threat hidden within our world, challenging their very existence – and our own."
    },
    {
        "title": "Underground Monster",
        "genre": "Fantasy",
        "plot": ""
    },
    {
        "title": "Black Noise",
        "genre": "Action",
        "plot": "Members of an elite security team deployed to rescue a VIP on an exclusive island.The rescue mission becomes a desperate attempt to survive, escape the island and elude the sinister presence that seeks to harm them."
    },
    {
        "title": "Boneyard",
        "genre": "Action",
        "plot": "After Police Chief Carter discovers the remains of eleven women, FBI Special Agent Petrovick is recruited to profile the serial killer responsible for the infamous \"boneyard\" killings. As the police force, narcotics agency, and FBI lock horns, a tangled web of intrigue turns everyone into a suspect."
    },
    {
        "title": "Goyo",
        "genre": "Drama",
        "plot": "A young autistic museum guide lives by a strict routine — until he falls in love with his coworker and must confront a whirlwind of new, intense emotions."
    },
    {
        "title": "Deadpool & Wolverine",
        "genre": "Science Fiction",
        "plot": "A listless Wade Wilson toils away in civilian life with his days as the morally flexible mercenary, Deadpool, behind him. But when his homeworld faces an existential threat, Wade must reluctantly suit-up again with an even more reluctant Wolverine."
    },
    {
        "title": "Civil War",
        "genre": "War",
        "plot": "In the near future, a group of war journalists attempt to survive while reporting the truth as the United States stands on the brink of civil war."
    },
    {
        "title": "Under Paris",
        "genre": "Thriller",
        "plot": "In order to save Paris from an international bloodbath, a grieving scientist is forced to face her tragic past when a giant shark appears in the Seine."
    },
    {
        "title": "Inside Out",
        "genre": "Animation",
        "plot": "When 11-year-old Riley moves to a new city, her Emotions team up to help her through the transition. Joy, Fear, Anger, Disgust and Sadness work together, but when Joy and Sadness get lost, they must journey through unfamiliar places to get back home."
    },
    {
        "title": "Trigger Warning",
        "genre": "Action",
        "plot": "A Special Forces commando uncovers a dangerous conspiracy when she returns to her hometown looking for answers into her beloved father's death."
    },
    {
        "title": "A Quiet Place: Day One",
        "genre": "Horror",
        "plot": "As New York City is invaded by alien creatures who hunt by sound, a woman named Sam fights to survive."
    },
    {
        "title": "Trigger Warning",
        "genre": "Action",
        "plot": "A Special Forces commando uncovers a dangerous conspiracy when she returns to her hometown looking for answers into her beloved father's death."
    },
    {
        "title": "Inside Out",
        "genre": "Animation",
        "plot": "When 11-year-old Riley moves to a new city, her Emotions team up to help her through the transition. Joy, Fear, Anger, Disgust and Sadness work together, but when Joy and Sadness get lost, they must journey through unfamiliar places to get back home."
    },
    {
        "title": "MR-9: Do or Die",
        "genre": "Action",
        "plot": "Masud Rana is a Secret Agent with code name MR-9 of the Bangladesh Counter Intelligence Agency"
    },
    {
        "title": "Twisters",
        "genre": "Action",
        "plot": "As storm season intensifies, the paths of former storm chaser Kate Carter and reckless social-media superstar Tyler Owens collide when terrifying phenomena never seen before are unleashed. The pair and their competing teams find themselves squarely in the paths of multiple storm systems converging over central Oklahoma in the fight of their lives."
    },
    {
        "title": "Kung Fu Panda 4",
        "genre": "Animation",
        "plot": "Po is gearing up to become the spiritual leader of his Valley of Peace, but also needs someone to take his place as Dragon Warrior. As such, he will train a new kung fu practitioner for the spot and will encounter a villain called the Chameleon who conjures villains from the past."
    },
    {
        "title": "My Fault",
        "genre": "Drama",
        "plot": "Noah must leave her city, boyfriend, and friends to move into William Leister's mansion, the flashy and wealthy husband of her mother Rafaela. As a proud and independent 17 year old, Noah resists living in a mansion surrounded by luxury. However, it is there where she meets Nick, her new stepbrother, and the clash of their strong personalities becomes evident from the very beginning."
    },
    {
        "title": "The Infallibles",
        "genre": "Comedy",
        "plot": "When a gang of robbers provokes chaos in Paris and humiliates the police, the Minister of the Interior wants new blood at the helm of the investigation: Alia is from Marseille, fiery-tempered and unmanageable, Hugo is Parisian, valedictorian and meticulous. In short, they have every reason to hate each other. A forced alliance, for better or for worse, or maybe blossoming into something else?"
    },
    {
        "title": "Autumn and the Black Jaguar",
        "genre": "Adventure",
        "plot": "Grown up in the Amazon rainforest, Autumn lives with Hope, the cute baby jaguar she adopted. However, a circumstance forces Autumn to return to New York. Autumn goes back into the jungle to save Hope from grave danger."
    },
    {
        "title": "An Ideal Father",
        "genre": "Drama",
        "plot": "Michel, the jovial owner of the only café in a small Normandy town, sees his life turned upside down when his teenage daughter is murdered. The community has his back but soon rumor spreads and Michel is singled out. From the ideal father, he becomes the ideal culprit."
    },
    {
        "title": "The Roundup: No Way Out",
        "genre": "Action",
        "plot": "Detective Ma Seok-do changes his affiliation from the Geumcheon Police Station to the Metropolitan Investigation Team, in order to eradicate Japanese gangsters who enter Korea to commit heinous crimes."
    },
    {
        "title": "The Last Kumite",
        "genre": "Action",
        "plot": "When Karate champion Michael Rivers wins the last tournament of his career, shady businessman Ron Hall offers him the opportunity to fight in an illegal Kumite in Bulgaria against the world’s best martial artists.  When Michael declines, Hall has his daughter kidnapped and, in order to rescue her, Rivers is left with no choice but to compete in the deadly tournament. Arriving in Bulgaria, he finds out that he is not the only fighter whose loved one was taken. Rivers enlists the help of trainers Master Loren, and Julie Jackson but will it be enough for him to win the tournament and save his daughter’s life?"
    },
    {
        "title": "The Fall Guy",
        "genre": "Action",
        "plot": "Fresh off an almost career-ending accident, stuntman Colt Seavers has to track down a missing movie star, solve a conspiracy and try to win back the love of his life while still doing his day job."
    },
    {
        "title": "The Watchers",
        "genre": "Fantasy",
        "plot": "A young artist gets stranded in an extensive, immaculate forest in western Ireland, where, after finding shelter, she becomes trapped alongside three strangers, stalked by mysterious creatures each night."
    },
    {
        "title": "Tarot",
        "genre": "Horror",
        "plot": "When a group of friends recklessly violate the sacred rule of Tarot readings, they unknowingly unleash an unspeakable evil trapped within the cursed cards. One by one, they come face to face with fate and end up in a race against death."
    },
    {
        "title": "Kleks Academy",
        "genre": "Fantasy",
        "plot": "A seemingly ordinary girl finds her way into the eponymous Academy to explore the world of fairy tales, imagination and creativity. With the help of a crazy, talented teacher, she develops her unique abilities and also stumbles upon a clue that will help her unravel the biggest secret of the family..."
    },
    {
        "title": "IF",
        "genre": "Comedy",
        "plot": "A young girl who goes through a difficult experience begins to see everyone's imaginary friends who have been left behind as their real-life friends have grown up."
    },
    {
        "title": "Out of Exile",
        "genre": "Thriller",
        "plot": "Recently paroled thief Gabriel Russell tries to balance his life and mend a troubled family as an FBI agent hunts him down, along with his crew after a botched armored car robbery."
    },
    {
        "title": "Tyler Perry's Divorce in the Black",
        "genre": "Drama",
        "plot": "Ava, a young bank professional is devastated when her husband Dallas abandons a marriage she is determined to fight for until fate intervenes, revealing Dallas' wicked deeds that have trashed their marriage, and once upon a time sabotaged Ava's destiny to be loved by her true soulmate."
    },
    {
        "title": "Godzilla Minus One",
        "genre": "Science Fiction",
        "plot": "In postwar Japan, Godzilla brings new devastation to an already scorched landscape. With no military intervention or government help in sight, the survivors must join together in the face of despair and fight back against an unrelenting horror."
    },
    {
        "title": "xXx",
        "genre": "Action",
        "plot": "Xander Cage is your standard adrenaline junkie with no fear and a lousy attitude. When the US Government \"recruits\" him to go on a mission, he's not exactly thrilled. His mission: to gather information on an organization that may just be planning the destruction of the world, led by the nihilistic Yorgi."
    },
    {
        "title": "Kleks Academy",
        "genre": "Fantasy",
        "plot": "A seemingly ordinary girl finds her way into the eponymous Academy to explore the world of fairy tales, imagination and creativity. With the help of a crazy, talented teacher, she develops her unique abilities and also stumbles upon a clue that will help her unravel the biggest secret of the family..."
    },
    {
        "title": "Dune: Part Two",
        "genre": "Science Fiction",
        "plot": "Follow the mythic journey of Paul Atreides as he unites with Chani and the Fremen while on a path of revenge against the conspirators who destroyed his family. Facing a choice between the love of his life and the fate of the known universe, Paul endeavors to prevent a terrible future only he can foresee."
    },
    {
        "title": "HAIKYU!! The Dumpster Battle",
        "genre": "Animation",
        "plot": "Shoyo Hinata joins Karasuno High's volleyball club to be like his idol, a former Karasuno player known as the 'Little Giant'. But Hinata soon learns that he must team up with his middle school nemesis, Tobio Kageyama. Their clashing styles form a surprising weapon, but can their newfound teamwork defeat their rival Nekoma High in the highly anticipated 'Dumpster Battle', the long awaited ultimate showdown between two opposing underdog teams?"
    },
    {
        "title": "Handling the Undead",
        "genre": "Horror",
        "plot": "On a hot summer day in Oslo, the dead mysteriously awaken, and three families are thrown into chaos when their deceased loved ones come back to them. Who are they, and what do they want?"
    },
    {
        "title": "Alienoid: Return to the Future",
        "genre": "Science Fiction",
        "plot": "Ean has a critical mission to return to the future to save everyone. However, she becomes trapped in the distant past while trying to prevent the escape of alien prisoners who are locked up in the bodies of humans. Meanwhile, Muruk, who helps Ean escape various predicaments, is unnerved when he begins sensing the presence of a strange being in his body. Traveling through the centuries, they are trying to prevent the explosion of the haava."
    },
    {
        "title": "Migration",
        "genre": "Animation",
        "plot": "After a migrating duck family alights on their pond with thrilling tales of far-flung places, the Mallard family embarks on a family road trip, from New England, to New York City, to tropical Jamaica."
    },
    {
        "title": "Miraculous World: Paris, Tales of Shadybug and Claw Noir",
        "genre": "Animation",
        "plot": "Miraculous holders from another world appear in Paris. They come from a parallel universe where everything is reversed: the holders of Ladybug and Black Cat Miraculouses, Shadybug and Claw Noir, are the bad guys, and the holder of the Butterfly Miraculous, Hesperia, is a superhero. Ladybug and Cat Noir will have to help Hesperia counter the attacks of their evil doubles and prevent them from seizing the Butterfly's Miraculous. Can our heroes also help Hesperia make Shadybug and Claw Noir better people?"
    },
    {
        "title": "Atlas",
        "genre": "Science Fiction",
        "plot": "A brilliant counterterrorism analyst with a deep distrust of AI discovers it might be her only hope when a mission to capture a renegade robot goes awry."
    },
    {
        "title": "Bad Boys for Life",
        "genre": "Thriller",
        "plot": "Marcus and Mike are forced to confront new threats, career changes, and midlife crises as they join the newly created elite team AMMO of the Miami police department to take down the ruthless Armando Armas, the vicious leader of a Miami drug cartel."
    },
    {
        "title": "No Way Up",
        "genre": "Thriller",
        "plot": "Characters from different backgrounds are thrown together when the plane they're travelling on crashes into the Pacific Ocean. A nightmare fight for survival ensues with the air supply running out and dangers creeping in from all sides."
    },
    {
        "title": "Bionic",
        "genre": "Science Fiction",
        "plot": "When the progress of robotics makes Paralympic athletes the new sports stars, Maria dreams of competing against her sister. For that, she will have to enter a world of crime and violence."
    },
    {
        "title": "Oppenheimer",
        "genre": "Drama",
        "plot": "The story of J. Robert Oppenheimer's role in the development of the atomic bomb during World War II."
    },
    {
        "title": "The First Omen",
        "genre": "Horror",
        "plot": "When a young American woman is sent to Rome to begin a life of service to the church, she encounters a darkness that causes her to question her own faith and uncovers a terrifying conspiracy that hopes to bring about the birth of evil incarnate."
    },
    {
        "title": "The Bikeriders",
        "genre": "Crime",
        "plot": "After a chance encounter, headstrong Kathy is drawn to Benny, member of Midwestern motorcycle club the Vandals. As the club transforms into a dangerous underworld of violence, Benny must choose between Kathy and his loyalty to the club."
    },
    {
        "title": "Wonka",
        "genre": "Comedy",
        "plot": "Willy Wonka – chock-full of ideas and determined to change the world one delectable bite at a time – is proof that the best things in life begin with a dream, and if you’re lucky enough to meet Willy Wonka, anything is possible."
    },
    {
        "title": "Wish",
        "genre": "Animation",
        "plot": "Asha, a sharp-witted idealist, makes a wish so powerful that it is answered by a cosmic force – a little ball of boundless energy called Star. Together, Asha and Star confront a most formidable foe - the ruler of Rosas, King Magnifico - to save her community and prove that when the will of one courageous human connects with the magic of the stars, wondrous things can happen."
    },
    {
        "title": "Iron Man 2",
        "genre": "Adventure",
        "plot": "With the world now aware of his dual life as the armored superhero Iron Man, billionaire inventor Tony Stark faces pressure from the government, the press and the public to share his technology with the military. Unwilling to let go of his invention, Stark, with Pepper Potts and James 'Rhodey' Rhodes at his side, must forge new alliances – and confront powerful enemies."
    },
    {
        "title": "The Boy and the Heron",
        "genre": "Animation",
        "plot": "While the Second World War rages, the teenage Mahito, haunted by his mother's tragic death, is relocated from Tokyo to the serene rural home of his new stepmother Natsuko, a woman who bears a striking resemblance to the boy's mother. As he tries to adjust, this strange new world grows even stranger following the appearance of a persistent gray heron, who perplexes and bedevils Mahito, dubbing him the \"long-awaited one.\""
    },
    {
        "title": "Longlegs",
        "genre": "Crime",
        "plot": "In pursuit of a serial killer, an FBI agent uncovers a series of occult clues that she must solve to end his terrifying killing spree."
    },
    {
        "title": "Iron Man 2",
        "genre": "Adventure",
        "plot": "With the world now aware of his dual life as the armored superhero Iron Man, billionaire inventor Tony Stark faces pressure from the government, the press and the public to share his technology with the military. Unwilling to let go of his invention, Stark, with Pepper Potts and James 'Rhodey' Rhodes at his side, must forge new alliances – and confront powerful enemies."
    },
    {
        "title": "The First Omen",
        "genre": "Horror",
        "plot": "When a young American woman is sent to Rome to begin a life of service to the church, she encounters a darkness that causes her to question her own faith and uncovers a terrifying conspiracy that hopes to bring about the birth of evil incarnate."
    },
    {
        "title": "Longlegs",
        "genre": "Crime",
        "plot": "In pursuit of a serial killer, an FBI agent uncovers a series of occult clues that she must solve to end his terrifying killing spree."
    },
    {
        "title": "Poor Things",
        "genre": "Science Fiction",
        "plot": "Brought back to life by an unorthodox scientist, a young woman runs off with a lawyer on a whirlwind adventure across the continents. Free from the prejudices of her times, she grows steadfast in her purpose to stand for equality and liberation."
    },
    {
        "title": "Space Cadet",
        "genre": "Comedy",
        "plot": "Tiffany \"Rex\" Simpson has always dreamed of going to space, and her \"doctored\" application lands her in NASA's ultra-competitive astronaut training program. In over her head, can this Florida girl rely on her quick wits, moxie and determination to get through training and into the cosmos before she blows her cover?"
    },
    {
        "title": "Immaculate",
        "genre": "Horror",
        "plot": "An American nun embarks on a new journey when she joins a remote convent in the Italian countryside. However, her warm welcome quickly turns into a living nightmare when she discovers her new home harbours a sinister secret and unspeakable horrors."
    },
    {
        "title": "Destroy All Neighbors",
        "genre": "Comedy",
        "plot": "William Brown, a neurotic, self-absorbed musician determined to finish his prog-rock magnum opus, faces a creative roadblock in the form of a noisy and grotesque neighbor named Vlad. Finally working up the nerve to demand that Vlad keep it down, William inadvertently decapitates him. But, while attempting to cover up one murder, William’s accidental reign of terror causes victims to pile up and become undead corpses who torment and create more bloody detours on his road to prog-rock Valhalla."
    },
    {
        "title": "Toy Story 2",
        "genre": "Animation",
        "plot": "Andy heads off to Cowboy Camp, leaving his toys to their own devices. Things shift into high gear when an obsessive toy collector named Al McWhiggen, owner of Al's Toy Barn kidnaps Woody. Andy's toys mount a daring rescue mission, Buzz Lightyear meets his match and Woody has to decide where he and his heart truly belong."
    },
    {
        "title": "Chappie",
        "genre": "Crime",
        "plot": "Every child comes into the world full of promise, and none more so than Chappie: he is gifted, special, a prodigy. Like any child, Chappie will come under the influence of his surroundings—some good, some bad—and he will rely on his heart and soul to find his way in the world and become his own man. But there's one thing that makes Chappie different from any one else: he is a robot."
    },
    {
        "title": "The Super Mario Bros. Movie",
        "genre": "Animation",
        "plot": "While working underground to fix a water main, Brooklyn plumbers—and brothers—Mario and Luigi are transported down a mysterious pipe and wander into a magical new world. But when the brothers are separated, Mario embarks on an epic quest to find Luigi."
    },
    {
        "title": "Fast X",
        "genre": "Action",
        "plot": "Over many missions and against impossible odds, Dom Toretto and his family have outsmarted, out-nerved and outdriven every foe in their path. Now, they confront the most lethal opponent they've ever faced: A terrifying threat emerging from the shadows of the past who's fueled by blood revenge, and who is determined to shatter this family and destroy everything—and everyone—that Dom loves, forever."
    },
    {
        "title": "Ultraman: Rising",
        "genre": "Animation",
        "plot": "A star athlete reluctantly returns home to take over his father's duties as Ultraman, shielding Tokyo from giant monsters as he becomes a legendary hero."
    },
    {
        "title": "Mad Max: Fury Road",
        "genre": "Action",
        "plot": "An apocalyptic story set in the furthest reaches of our planet, in a stark desert landscape where humanity is broken, and most everyone is crazed fighting for the necessities of life. Within this world exist two rebels on the run who just might be able to restore order."
    },
    {
        "title": "Wrong Turn 5: Bloodlines",
        "genre": "Horror",
        "plot": "A small West Virginia town is hosting the legendary Mountain Man Festival on Halloween, where throngs of costumed party goers gather for a wild night of music and mischief. But an inbred family of hillbilly cannibals kill the fun when they trick and treat themselves to a group of visiting college students."
    },
    {
        "title": "Exhuma",
        "genre": "Mystery",
        "plot": "After tracing the origin of a disturbing supernatural affliction to a wealthy family's ancestral gravesite, a team of paranormal experts relocates the remains—and soon discovers what happens to those who dare to mess with the wrong grave."
    },
    {
        "title": "La Familia del Barrio: La Película",
        "genre": "Comedy",
        "plot": "El Noruego travels back in time and accidentally prevents the War of Independence by getting Miguel Hidalgo drunk before giving the cry."
    },
    {
        "title": "Se7en",
        "genre": "Crime",
        "plot": "Two homicide detectives are on a desperate hunt for a serial killer whose crimes are based on the \"seven deadly sins\" in this dark and haunting film that takes viewers from the tortured remains of one victim to the next. The seasoned Det. Sommerset researches each sin in an effort to get inside the killer's mind, while his novice partner, Mills, scoffs at his efforts to unravel the case."
    },
    {
        "title": "White Chicks",
        "genre": "Comedy",
        "plot": "Two FBI agent brothers, Marcus and Kevin Copeland, accidentally foil a drug bust. To avoid being fired they accept a mission escorting a pair of socialites to the Hamptons--but when the girls are disfigured in a car accident, they refuse to go. Left without options, Marcus and Kevin decide to pose as the sisters, transforming themselves from black men into rich white women."
    },
    {
        "title": "Madame Web",
        "genre": "Action",
        "plot": "Forced to confront revelations about her past, paramedic Cassandra Webb forges a relationship with three young women destined for powerful futures...if they can all survive a deadly present."
    },
    {
        "title": "Descendants",
        "genre": "Family",
        "plot": "A present-day idyllic kingdom where the benevolent teenage son of King Adam and Queen Belle offers a chance of redemption for the troublemaking offspring of Disney's classic villains: Cruella De Vil (Carlos), Maleficent (Mal), the Evil Queen (Evie) and Jafar (Jay)."
    },
    {
        "title": "Anyone But You",
        "genre": "Romance",
        "plot": "After an amazing first date, Bea and Ben’s fiery attraction turns ice cold — until they find themselves unexpectedly reunited at a destination wedding in Australia. So they do what any two mature adults would do: pretend to be a couple."
    },
    {
        "title": "Deadpool",
        "genre": "Action",
        "plot": "The origin story of former Special Forces operative turned mercenary Wade Wilson, who, after being subjected to a rogue experiment that leaves him with accelerated healing powers, adopts the alter ego Deadpool. Armed with his new abilities and a dark, twisted sense of humor, Deadpool hunts down the man who nearly destroyed his life."
    },
    {
        "title": "John Wick: Chapter 4",
        "genre": "Action",
        "plot": "With the price on his head ever increasing, John Wick uncovers a path to defeating The High Table. But before he can earn his freedom, Wick must face off against a new enemy with powerful alliances across the globe and forces that turn old friends into foes."
    },
    {
        "title": "Howl's Moving Castle",
        "genre": "Fantasy",
        "plot": "Sophie, a young milliner, is turned into an elderly woman by a witch who enters her shop and curses her. She encounters a wizard named Howl and gets caught up in his resistance to fighting for the king."
    },
    {
        "title": "The Godfather Part III",
        "genre": "Crime",
        "plot": "In the midst of trying to legitimize his business dealings in 1979 New York and Italy, aging mafia don, Michael Corleone seeks forgiveness for his sins while taking a young protege under his wing."
    },
    {
        "title": "Ghostbusters: Frozen Empire",
        "genre": "Fantasy",
        "plot": "When the discovery of an ancient artifact unleashes an evil force, Ghostbusters new and old must join forces to protect their home and save the world from a second Ice Age."
    },
    {
        "title": "Spider-Man: Across the Spider-Verse",
        "genre": "Animation",
        "plot": "After reuniting with Gwen Stacy, Brooklyn’s full-time, friendly neighborhood Spider-Man is catapulted across the Multiverse, where he encounters the Spider Society, a team of Spider-People charged with protecting the Multiverse’s very existence. But when the heroes clash on how to handle a new threat, Miles finds himself pitted against the other Spiders and must set out on his own to save those he loves most."
    },
    {
        "title": "Battle Over Britain",
        "genre": "War",
        "plot": "A young pilot, fresh out of training, is called to join a Flight while they wait for the call to scramble. Throughout a single day, he witnesses the skies of southern England filled with deadly dog fights, and after every exhausting battle the men return to their dispersal hut, only to find another of their number missing. Unwilling to surrender, the pilot and his comrades unite to take to the skies once more, determined to defend not only the airfield, but their entire country."
    },
    {
        "title": "No Time to Spy: A Loud House Movie",
        "genre": "Animation",
        "plot": "Lincoln and the Louds are ecstatic to welcome their new Gran-Gran, Myrtle, into the family with a tropical wedding celebration; but the festivities are cut short when an old nemesis from Myrtle's secret agent past appears on the island."
    },
    {
        "title": "Fall",
        "genre": "Thriller",
        "plot": "For best friends Becky and Hunter, life is all about conquering fears and pushing limits. But after they climb 2,000 feet to the top of a remote, abandoned radio tower, they find themselves stranded with no way down. Now Becky and Hunter’s expert climbing skills will be put to the ultimate test as they desperately fight to survive the elements, a lack of supplies, and vertigo-inducing heights"
    },
    {
        "title": "Alienoid",
        "genre": "Science Fiction",
        "plot": "Gurus in the late Goryeo dynasty try to obtain a fabled, holy sword, and humans in 2022 hunt down an alien prisoner that is locked in a human's body. The two parties cross paths when a time-traveling portal opens up."
    },
    {
        "title": "HAIKYU!! The Dumpster Battle",
        "genre": "Animation",
        "plot": "Shoyo Hinata joins Karasuno High's volleyball club to be like his idol, a former Karasuno player known as the 'Little Giant'. But Hinata soon learns that he must team up with his middle school nemesis, Tobio Kageyama. Their clashing styles form a surprising weapon, but can their newfound teamwork defeat their rival Nekoma High in the highly anticipated 'Dumpster Battle', the long awaited ultimate showdown between two opposing underdog teams?"
    },
    {
        "title": "The Bikeriders",
        "genre": "Crime",
        "plot": "After a chance encounter, headstrong Kathy is drawn to Benny, member of Midwestern motorcycle club the Vandals. As the club transforms into a dangerous underworld of violence, Benny must choose between Kathy and his loyalty to the club."
    },
    {
        "title": "The Raffle",
        "genre": "Drama",
        "plot": "Struggling with a financial crisis, a good-looking widow decides to put herself up for grabs. However, going through with it becomes almost impossible with a new love and the legal system thrown into the mix."
    },
    {
        "title": "Road House",
        "genre": "Action",
        "plot": "Ex-UFC fighter Dalton takes a job as a bouncer at a Florida Keys roadhouse, only to discover that this paradise is not all it seems."
    },
    {
        "title": "A Family Affair",
        "genre": "Romance",
        "plot": "The only thing worse than being the assistant to a high-maintenance movie star who doesn't take you seriously? Finding out he's smitten with your mom."
    },
    {
        "title": "Ocean's Eleven",
        "genre": "Thriller",
        "plot": "Less than 24 hours into his parole, charismatic thief Danny Ocean is already rolling out his next plan: In one night, Danny's hand-picked crew of specialists will attempt to steal more than $150 million from three Las Vegas casinos. But to score the cash, Danny risks his chances of reconciling with ex-wife, Tess."
    },
    {
        "title": "Japanese Mom",
        "genre": "Romance",
        "plot": "\"Innocent face, D-cup breasts and perfect intercourse skills! Son, this is not your girlfriend anymore but your mother!\"  Ki-ho brings Yuki from Japan to marry her. However, he starts cheating on her with his ex-girlfriend in Korea.  Min-cheol comforted Yuki and thought of her as his daughter-in-law, but one day he realizes he is looking at her as a woman.  In the end, Yuki and Min-cheol have intercourse without Ki-ho knowing..."
    },
    {
        "title": "Late Night with the Devil",
        "genre": "Horror",
        "plot": "A live broadcast of a late-night talk show in 1977 goes horribly wrong, unleashing evil into the nation's living rooms."
    },
    {
        "title": "Death Whisperer",
        "genre": "Horror",
        "plot": "When a remote village is plagued by a deadly curse, one brother must fight to save his family from a terrifying supernatural threat."
    },
    {
        "title": "Babylon",
        "genre": "Drama",
        "plot": "A tale of outsized ambition and outrageous excess, tracing the rise and fall of multiple characters in an era of unbridled decadence and depravity during Hollywood's transition from silent films to sound films in the late 1920s."
    },
    {
        "title": "Despicable Me",
        "genre": "Family",
        "plot": "Villainous Gru lives up to his reputation as a despicable, deplorable and downright unlikable guy when he hatches a plan to steal the moon from the sky. But he has a tough time staying on task after three orphans land in his care."
    },
    {
        "title": "In Time",
        "genre": "Action",
        "plot": "In the not-too-distant future, the aging gene has been switched off. To avoid overpopulation, time has become the currency and the way people pay for luxuries and necessities. The rich can live forever, while the rest try to negotiate for their immortality. A poor young man who comes into a fortune of time is too late to help his mother from dying. He ends up on the run from a corrupt police force known as the \"time keepers\"."
    },
    {
        "title": "Creed II",
        "genre": "Drama",
        "plot": "Between personal obligations and training for his next big fight against an opponent with ties to his family's past, Adonis Creed is up against the challenge of his life."
    },
    {
        "title": "Drawing Closer",
        "genre": "Romance",
        "plot": "With only a year left to live, 17-year-old Akito finds new meaning in life by bringing joy to a terminally ill girl who has just six months remaining."
    },
    {
        "title": "The Idea of You",
        "genre": "Romance",
        "plot": "40-year-old single mom Solène begins an unexpected romance with 24-year-old Hayes Campbell, the lead singer of August Moon, the hottest boy band on the planet. As they begin a whirlwind romance, it isn't long before Hayes' superstar status poses unavoidable challenges to their relationship, and Solène soon discovers that life in the glare of his spotlight might be more than she bargained for."
    },
    {
        "title": "Hercules",
        "genre": "Animation",
        "plot": "Bestowed with superhuman strength, a young mortal named Hercules sets out to prove himself a hero in the eyes of his father, the great god Zeus. Along with his friends Pegasus, a flying horse, and Phil, a personal trainer, Hercules is tricked by the hilarious, hotheaded villain Hades, who's plotting to take over Mount Olympus!"
    },
    {
        "title": "The Beekeeper",
        "genre": "Action",
        "plot": "One man's campaign for vengeance takes on national stakes after he is revealed to be a former operative of a powerful and clandestine organization known as Beekeepers."
    },
    {
        "title": "Avengers: Infinity War",
        "genre": "Adventure",
        "plot": "As the Avengers and their allies have continued to protect the world from threats too large for any one hero to handle, a new danger has emerged from the cosmic shadows: Thanos. A despot of intergalactic infamy, his goal is to collect all six Infinity Stones, artifacts of unimaginable power, and use them to inflict his twisted will on all of reality. Everything the Avengers have fought for has led up to this moment - the fate of Earth and existence itself has never been more uncertain."
    },
    {
        "title": "Spider-Man: No Way Home",
        "genre": "Action",
        "plot": "Peter Parker is unmasked and no longer able to separate his normal life from the high-stakes of being a super-hero. When he asks for help from Doctor Strange the stakes become even more dangerous, forcing him to discover what it truly means to be Spider-Man."
    },
    {
        "title": "The Wages of Fear",
        "genre": "Action",
        "plot": "When an explosion at an oil well threatens hundreds of lives, a crack team is called upon to make a deadly desert crossing with nitroglycerine in tow."
    },
    {
        "title": "The Little Mermaid",
        "genre": "Animation",
        "plot": "This colorful adventure tells the story of an impetuous mermaid princess named Ariel who falls in love with the very human Prince Eric and puts everything on the line for the chance to be with him. Memorable songs and characters -- including the villainous sea witch Ursula."
    },
    {
        "title": "MaXXXine",
        "genre": "Horror",
        "plot": "In 1980s Hollywood, adult film star and aspiring actress Maxine Minx finally gets her big break. But as a mysterious killer stalks the starlets of Hollywood, a trail of blood threatens to reveal her sinister past."
    },
    {
        "title": "Top Gunner: Danger Zone",
        "genre": "Action",
        "plot": "An airliner filled with 800 passengers is forced to fly fast and low, above farmlands, suburbs and skyscraper-packed cities or the tons of explosives aboard will detonate. When an elite unit of US Air Force fighter jets is sent to provide escort, they find themselves facing a squadron of unidentifiable warplanes which ignites a deadly air battle that threatens to destroy all life above and below."
    },
    {
        "title": "Pleasure",
        "genre": "Drama",
        "plot": "19 year old Linnéa leaves her small town in Sweden and heads for Los Angeles with the aim of becoming the world's next big porn star, but the road to her goal turns out to be bumpier than she imagined."
    },
    {
        "title": "Mean Girls",
        "genre": "Drama",
        "plot": "Cady Heron is a hit with The Plastics, the A-list girl clique at her new school, until she makes the mistake of falling for Aaron Samuels, the ex-boyfriend of alpha Plastic Regina George."
    },
    {
        "title": "May the 12th Be with You",
        "genre": "Animation",
        "plot": "It's Mother's Day and Marge Simpson joins the moms of Disney+ on a special holiday outing that turns into an epic galactic adventure filled with heroes, villains, and Stewie from Family Guy."
    },
    {
        "title": "Monsters vs Aliens",
        "genre": "Animation",
        "plot": "When Susan Murphy is unwittingly clobbered by a meteor full of outer space gunk on her wedding day, she mysteriously grows to 49-feet-11-inches. The military jumps into action and captures Susan, secreting her away to a covert government compound. She is renamed Ginormica and placed in confinement with a ragtag group of Monsters..."
    },
    {
        "title": "El Halcón: Sed de Venganza",
        "genre": "Action",
        "plot": "Criminals control Mexico and wrestling is now illegal. A retired fighter and a policewoman join forces to stop the perfidious criminal who has kidnapped her son."
    },
    {
        "title": "Kingdom of Heaven",
        "genre": "Drama",
        "plot": "After his wife dies, a blacksmith named Balian is thrust into royalty, political intrigue and bloody holy wars during the Crusades."
    },
    {
        "title": "Abigail",
        "genre": "Horror",
        "plot": "A group of criminals kidnaps a teenage ballet dancer, the daughter of a notorious gang leader, in order to obtain a ransom of $50 million, but over time, they discover that she is not just an ordinary girl. After the kidnappers begin to diminish, one by one, they discover, to their increasing horror, that they are locked inside with an unusual girl."
    },
    {
        "title": "Rascal Does Not Dream of a Knapsack Kid",
        "genre": "Animation",
        "plot": "Finally, the day of Mai's high school graduation has arrived. While Sakuta eagerly waits for his girlfriend, an elementary schooler who looks exactly like her appears before him. Suspicious, and for all the wrong reasons... Meanwhile, Sakuta and Kaede's father suddenly calls, saying that their mother wants to see her daughter. She was hospitalized because Kaede's condition had been too much for her to bear, so what could she possibly want now?"
    },
    {
        "title": "Dawn of the Planet of the Apes",
        "genre": "Science Fiction",
        "plot": "A group of scientists in San Francisco struggle to stay alive in the aftermath of a plague that is wiping out humanity, while Caesar tries to maintain dominance over his community of intelligent apes."
    },
    {
        "title": "Creation of the Gods I: Kingdom of Storms",
        "genre": "Action",
        "plot": "Based on the most well-known classical fantasy novel of China, Fengshenyanyi, the trilogy is a magnificent eastern high fantasy epic that recreates the prolonged mythical wars between humans, immortals and monsters, which happened more than three thousand years ago."
    },
    {
        "title": "Fall",
        "genre": "Thriller",
        "plot": "For best friends Becky and Hunter, life is all about conquering fears and pushing limits. But after they climb 2,000 feet to the top of a remote, abandoned radio tower, they find themselves stranded with no way down. Now Becky and Hunter’s expert climbing skills will be put to the ultimate test as they desperately fight to survive the elements, a lack of supplies, and vertigo-inducing heights"
    },
    {
        "title": "Megamind vs. the Doom Syndicate",
        "genre": "Animation",
        "plot": "Megamind's former villain team, The Doom Syndicate, has returned. Our newly crowned blue hero must now keep up evil appearances until he can assemble his friends (Roxanne, Ol' Chum and Keiko) to stop his former evil teammates from launching Metro City to the Moon."
    },
    {
        "title": "The Godfather Part III",
        "genre": "Crime",
        "plot": "In the midst of trying to legitimize his business dealings in 1979 New York and Italy, aging mafia don, Michael Corleone seeks forgiveness for his sins while taking a young protege under his wing."
    },
    {
        "title": "Wrong Turn 5: Bloodlines",
        "genre": "Horror",
        "plot": "A small West Virginia town is hosting the legendary Mountain Man Festival on Halloween, where throngs of costumed party goers gather for a wild night of music and mischief. But an inbred family of hillbilly cannibals kill the fun when they trick and treat themselves to a group of visiting college students."
    },
    {
        "title": "Hit Man",
        "genre": "Crime",
        "plot": "A mild-mannered professor moonlighting as a fake hit man in police stings ignites a chain reaction of trouble when he falls for a potential client."
    },
    {
        "title": "White Chicks",
        "genre": "Comedy",
        "plot": "Two FBI agent brothers, Marcus and Kevin Copeland, accidentally foil a drug bust. To avoid being fired they accept a mission escorting a pair of socialites to the Hamptons--but when the girls are disfigured in a car accident, they refuse to go. Left without options, Marcus and Kevin decide to pose as the sisters, transforming themselves from black men into rich white women."
    },
    {
        "title": "Twister",
        "genre": "Action",
        "plot": "An unprecedented series of violent tornadoes is sweeping across Oklahoma. Tornado chasers, headed by Dr. Jo Harding, attempt to release a groundbreaking device that will allow them to track them and create a more advanced warning system. They are joined by Jo's soon to be ex-husband Bill, a former tornado chaser himself, and his girlfriend Melissa."
    },
    {
        "title": "The Chronicles of Narnia: The Lion, the Witch and the Wardrobe",
        "genre": "Adventure",
        "plot": "Siblings Lucy, Edmund, Susan and Peter step through a magical wardrobe and find the land of Narnia. There, they discover a charming, once peaceful kingdom that has been plunged into eternal winter by the evil White Witch, Jadis. Aided by the wise and magnificent lion, Aslan, the children lead Narnia into a spectacular, climactic battle to be free of the Witch's glacial powers forever."
    },
    {
        "title": "Harry Potter and the Philosopher's Stone",
        "genre": "Adventure",
        "plot": "Harry Potter has lived under the stairs at his aunt and uncle's house his whole life. But on his 11th birthday, he learns he's a powerful wizard—with a place waiting for him at the Hogwarts School of Witchcraft and Wizardry. As he learns to harness his newfound powers with the help of the school's kindly headmaster, Harry uncovers the truth about his parents' deaths—and about the villain who's to blame."
    },
    {
        "title": "Breathe",
        "genre": "Science Fiction",
        "plot": "Air-supply is scarce in the near future, forcing a mother and daughter to fight for survival when two strangers arrive desperate for an oxygenated haven."
    },
    {
        "title": "Shrek",
        "genre": "Animation",
        "plot": "It ain't easy bein' green -- especially if you're a likable (albeit smelly) ogre named Shrek. On a mission to retrieve a gorgeous princess from the clutches of a fire-breathing dragon, Shrek teams up with an unlikely compatriot -- a wisecracking donkey."
    },
    {
        "title": "Puss in Boots: The Last Wish",
        "genre": "Animation",
        "plot": "Puss in Boots discovers that his passion for adventure has taken its toll: He has burned through eight of his nine lives, leaving him with only one life left. Puss sets out on an epic journey to find the mythical Last Wish and restore his nine lives."
    },
    {
        "title": "Japanese Mom",
        "genre": "Romance",
        "plot": "\"Innocent face, D-cup breasts and perfect intercourse skills! Son, this is not your girlfriend anymore but your mother!\"  Ki-ho brings Yuki from Japan to marry her. However, he starts cheating on her with his ex-girlfriend in Korea.  Min-cheol comforted Yuki and thought of her as his daughter-in-law, but one day he realizes he is looking at her as a woman.  In the end, Yuki and Min-cheol have intercourse without Ki-ho knowing..."
    },
    {
        "title": "A Quiet Place Part III",
        "genre": "Thriller",
        "plot": "The third film in John Krasinski's A Quiet Place trilogy."
    },
    {
        "title": "Love Lies Bleeding",
        "genre": "Crime",
        "plot": "Reclusive gym manager Lou falls hard for Jackie, an ambitious bodybuilder headed through town to Las Vegas in pursuit of her dream. But their love ignites violence, pulling them deep into the web of Lou’s criminal family."
    },
    {
        "title": "Ocean's Eleven",
        "genre": "Thriller",
        "plot": "Less than 24 hours into his parole, charismatic thief Danny Ocean is already rolling out his next plan: In one night, Danny's hand-picked crew of specialists will attempt to steal more than $150 million from three Las Vegas casinos. But to score the cash, Danny risks his chances of reconciling with ex-wife, Tess."
    },
    {
        "title": "Scream VI",
        "genre": "Horror",
        "plot": "Following the latest Ghostface killings, the four survivors leave Woodsboro behind and start a fresh chapter."
    },
    {
        "title": "Rebel Moon - Part Two: The Scargiver",
        "genre": "Science Fiction",
        "plot": "The rebels gear up for battle against the ruthless forces of the Motherworld as unbreakable bonds are forged, heroes emerge — and legends are made."
    },
    {
        "title": "Minions: The Rise of Gru",
        "genre": "Animation",
        "plot": "A fanboy of a supervillain supergroup known as the Vicious 6, Gru hatches a plan to become evil enough to join them, with the backup of his followers, the Minions."
    },
    {
        "title": "Concrete Utopia",
        "genre": "Thriller",
        "plot": "The world has been reduced to rubble by a massive earthquake. While no one knows for sure how far the ruins stretch, or what the cause of the earthquake may be, in the heart of Seoul there is only one apartment building left standing. It is called Hwang Gung Apartments. As time passes, outsiders start coming in to Hwang Gung Apartments trying to escape the extreme cold. Before long, the apartment residents are unable to cope with the increasing numbers. Feeling a threat to their very survival, the residents enact a special measure."
    },
    {
        "title": "Hit Man",
        "genre": "Crime",
        "plot": "A mild-mannered professor moonlighting as a fake hit man in police stings ignites a chain reaction of trouble when he falls for a potential client."
    },
    {
        "title": "Godzilla",
        "genre": "Action",
        "plot": "Ford Brody, a Navy bomb expert, has just reunited with his family in San Francisco when he is forced to go to Japan to help his estranged father, Joe. Soon, both men are swept up in an escalating crisis when an ancient alpha predator arises from the sea to combat malevolent adversaries that threaten the survival of humanity. The creatures leave colossal destruction in their wake, as they make their way toward their final battleground: San Francisco."
    },
    {
        "title": "Monster's Battlefield",
        "genre": "Science Fiction",
        "plot": "The soldier king Qin Yang's fiancée Ye Qin met with an unknown beast and died tragically. Gu Ping invites him to participate in Ye Qin's scientific research before her death. But Gu Ping is using Ye Qin's research results to combine the genes of unknown beasts to create the \"Zero\" dragon creature. The intelligent dragon creature, coupled with the extra-terrestrial beast evolved by devouring,  an imminent city war is coming..."
    },
    {
        "title": "Shrek",
        "genre": "Animation",
        "plot": "It ain't easy bein' green -- especially if you're a likable (albeit smelly) ogre named Shrek. On a mission to retrieve a gorgeous princess from the clutches of a fire-breathing dragon, Shrek teams up with an unlikely compatriot -- a wisecracking donkey."
    },
    {
        "title": "Rascal Does Not Dream of a Knapsack Kid",
        "genre": "Animation",
        "plot": "Finally, the day of Mai's high school graduation has arrived. While Sakuta eagerly waits for his girlfriend, an elementary schooler who looks exactly like her appears before him. Suspicious, and for all the wrong reasons... Meanwhile, Sakuta and Kaede's father suddenly calls, saying that their mother wants to see her daughter. She was hospitalized because Kaede's condition had been too much for her to bear, so what could she possibly want now?"
    },
    {
        "title": "Damsel",
        "genre": "Fantasy",
        "plot": "A young woman's marriage to a charming prince turns into a fierce fight for survival when she's offered up as a sacrifice to a fire-breathing dragon."
    },
    {
        "title": "Twister",
        "genre": "Action",
        "plot": "An unprecedented series of violent tornadoes is sweeping across Oklahoma. Tornado chasers, headed by Dr. Jo Harding, attempt to release a groundbreaking device that will allow them to track them and create a more advanced warning system. They are joined by Jo's soon to be ex-husband Bill, a former tornado chaser himself, and his girlfriend Melissa."
    },
    {
        "title": "Harry Potter and the Philosopher's Stone",
        "genre": "Adventure",
        "plot": "Harry Potter has lived under the stairs at his aunt and uncle's house his whole life. But on his 11th birthday, he learns he's a powerful wizard—with a place waiting for him at the Hogwarts School of Witchcraft and Wizardry. As he learns to harness his newfound powers with the help of the school's kindly headmaster, Harry uncovers the truth about his parents' deaths—and about the villain who's to blame."
    },
    {
        "title": "Io Capitano",
        "genre": "Adventure",
        "plot": "Longing for a brighter future, two Senegalese teenagers embark on a journey from West Africa to Italy. However, between their dreams and reality lies a labyrinth of checkpoints, the Sahara Desert, and the vast waters of the Mediterranean."
    },
    {
        "title": "Breathe",
        "genre": "Science Fiction",
        "plot": "Air-supply is scarce in the near future, forcing a mother and daughter to fight for survival when two strangers arrive desperate for an oxygenated haven."
    },
    {
        "title": "It’s for Your Own Good",
        "genre": "Comedy",
        "plot": "Horrified by the new girlfriends of their respective sons, three sisters-in-law – Clara, a socialite, Matis, a widowed professional, and Nena, a naive housewife – make an alliance to get rid of their undesirable daughters-in-law."
    },
    {
        "title": "A Quiet Place Part II",
        "genre": "Science Fiction",
        "plot": "Following the events at home, the Abbott family now face the terrors of the outside world. Forced to venture into the unknown, they realize that the creatures that hunt by sound are not the only threats that lurk beyond the sand path."
    },
    {
        "title": "Nightmares",
        "genre": "Horror",
        "plot": "A successful young doctor is constantly haunted by nightmares about a mysterious killer who seems to not only be chasing her in her dreams."
    },
    {
        "title": "The Family Plan",
        "genre": "Action",
        "plot": "Dan Morgan is many things: a devoted husband, a loving father, a celebrated car salesman. He's also a former assassin. And when his past catches up to his present, he's forced to take his unsuspecting family on a road trip unlike any other."
    },
    {
        "title": "Descendants 2",
        "genre": "Family",
        "plot": "When the pressure to be royal becomes too much for Mal, she returns to the Isle of the Lost where her archenemy Uma, Ursula's daughter, has taken her spot as self-proclaimed queen."
    },
    {
        "title": "Friday the 13th Part III",
        "genre": "Horror",
        "plot": "An idyllic summer turns into a nightmare of unspeakable terror for yet another group of naïve counselors. Ignoring Camp Crystal Lake's bloody legacy, one by one they fall victim to the maniacal Jason, who stalks them at every turn..."
    },
    {
        "title": "Love Lies Bleeding",
        "genre": "Crime",
        "plot": "Reclusive gym manager Lou falls hard for Jackie, an ambitious bodybuilder headed through town to Las Vegas in pursuit of her dream. But their love ignites violence, pulling them deep into the web of Lou’s criminal family."
    },
    {
        "title": "Poseidon",
        "genre": "Adventure",
        "plot": "A packed cruise ship traveling the Atlantic is hit and overturned by a massive wave, compelling the passengers to begin a dramatic fight for their lives."
    },
    {
        "title": "Jeepers Creepers 2",
        "genre": "Horror",
        "plot": "When their bus is crippled on the side of a deserted road, a team of high school athletes discover an opponent they cannot defeat – and may not survive."
    },
    {
        "title": "Land of Bad",
        "genre": "Action",
        "plot": "When a Delta Force special ops mission goes terribly wrong, Air Force drone pilot Reaper has 48 hours to remedy what has devolved into a wild rescue operation. With no weapons and no communication other than the drone above, the ground mission suddenly becomes a full-scale battle when the team is discovered by the enemy."
    },
    {
        "title": "Titanic",
        "genre": "Drama",
        "plot": "101-year-old Rose DeWitt Bukater tells the story of her life aboard the Titanic, 84 years later. A young Rose boards the ship with her mother and fiancé. Meanwhile, Jack Dawson and Fabrizio De Rossi win third-class tickets aboard the ship. Rose tells the whole story from Titanic's departure through to its death—on its first and last voyage—on April 15, 1912."
    },
    {
        "title": "Twilight",
        "genre": "Fantasy",
        "plot": "When Bella Swan moves to a small town in the Pacific Northwest, she falls in love with Edward Cullen, a mysterious classmate who reveals himself to be a 108-year-old vampire. Despite Edward's repeated cautions, Bella can't stay away from him, a fatal move that endangers her own life."
    },
    {
        "title": "Dawn of the Planet of the Apes",
        "genre": "Science Fiction",
        "plot": "A group of scientists in San Francisco struggle to stay alive in the aftermath of a plague that is wiping out humanity, while Caesar tries to maintain dominance over his community of intelligent apes."
    },
    {
        "title": "Trading Places",
        "genre": "Comedy",
        "plot": "A snobbish investor and a wily street con-artist find their positions reversed as part of a bet by two callous millionaires."
    },
    {
        "title": "Barbie",
        "genre": "Comedy",
        "plot": "Barbie and Ken are having the time of their lives in the colorful and seemingly perfect world of Barbie Land. However, when they get a chance to go to the real world, they soon discover the joys and perils of living among humans."
    },
    {
        "title": "Coraline",
        "genre": "Animation",
        "plot": "A young girl discovers an idealized parallel universe behind a secret door in her new home, unaware that it contains a sinister secret."
    },
    {
        "title": "Bridge to Terabithia",
        "genre": "Adventure",
        "plot": "Jesse Aarons trained all summer to become the fastest runner in school. So he's very upset when newcomer Leslie Burke outruns him and everyone else. Despite this and other differences including that she's rich, he's poor, she's a city girl, and he's a country boy the two become fast friends. Together they create Terabithia, a land of monsters, trolls, ogres, and giants where they rule as king and queen."
    },
    {
        "title": "Deadpool 2",
        "genre": "Action",
        "plot": "Wisecracking mercenary Deadpool battles the evil and powerful Cable and other bad guys to save a boy's life."
    },
    {
        "title": "Crank",
        "genre": "Action",
        "plot": "Chev Chelios, a hit man wanting to go straight, lets his latest target slip away. Then he awakes the next morning to a phone call that informs him he has been poisoned and has only an hour to live unless he keeps adrenaline coursing through his body while he searches for an antidote."
    },
    {
        "title": "After the Pandemic",
        "genre": "Science Fiction",
        "plot": "Set in a post-apocalyptic world where a global airborne pandemic has wiped out 90% of the Earth's population and only the young and immune have endured as scavengers. For Ellie and Quinn, the daily challenges to stay alive are compounded when they become hunted by the merciless Stalkers."
    },
    {
        "title": "Blood and Snow",
        "genre": "Science Fiction",
        "plot": "Scientists find meteor in Arctic. It kills one, infects the other. Nearby base takes in survivor to investigate incident. Survivor's identity raises questions."
    },
    {
        "title": "A Quiet Place",
        "genre": "Horror",
        "plot": "A family is forced to live in silence while hiding from creatures that hunt by sound."
    },
    {
        "title": "Creation of the Gods I: Kingdom of Storms",
        "genre": "Action",
        "plot": "Based on the most well-known classical fantasy novel of China, Fengshenyanyi, the trilogy is a magnificent eastern high fantasy epic that recreates the prolonged mythical wars between humans, immortals and monsters, which happened more than three thousand years ago."
    },
    {
        "title": "Bad Boys",
        "genre": "Action",
        "plot": "Marcus Burnett is a henpecked family man. Mike Lowry is a footloose and fancy free ladies' man. Both Miami policemen, they have 72 hours to reclaim a consignment of drugs stolen from under their station's nose. To complicate matters, in order to get the assistance of the sole witness to a murder, they have to pretend to be each other."
    },
    {
        "title": "The Roundup: Punishment",
        "genre": "Crime",
        "plot": "'Monster Cop' Ma Seok-do investigates an illegal online gambling business led by a former STS Baek and an IT genius CEO Chang. Ma proposes an unexpected alliance to Jang and begins hunting down the criminals."
    },
    {
        "title": "Top Gun",
        "genre": "Drama",
        "plot": "For Lieutenant Pete 'Maverick' Mitchell and his friend and co-pilot Nick 'Goose' Bradshaw, being accepted into an elite training school for fighter pilots is a dream come true. But a tragedy, as well as personal demons, will threaten Pete's dreams of becoming an ace pilot."
    },
    {
        "title": "Fly Me to the Moon",
        "genre": "Comedy",
        "plot": "Sparks fly in all directions as marketing maven Kelly Jones, brought in to fix NASA's public image, wreaks havoc on Apollo 11 launch director Cole Davis' already difficult task of putting a man on the moon. When the White House deems the mission too important to fail, Jones is directed to stage a fake moon landing as backup, and the countdown truly begins."
    },
    {
        "title": "Sing and Don't Cry",
        "genre": "Comedy",
        "plot": "A matriarchal family runs a taco food truck, navigating between artistic aspirations and daily frustrations while raising a member's daughter."
    },
    {
        "title": "Hercules",
        "genre": "Animation",
        "plot": "Bestowed with superhuman strength, a young mortal named Hercules sets out to prove himself a hero in the eyes of his father, the great god Zeus. Along with his friends Pegasus, a flying horse, and Phil, a personal trainer, Hercules is tricked by the hilarious, hotheaded villain Hades, who's plotting to take over Mount Olympus!"
    },
    {
        "title": "A Quiet Place",
        "genre": "Horror",
        "plot": "A family is forced to live in silence while hiding from creatures that hunt by sound."
    },
    {
        "title": "The Legend of Catclaws Mountain",
        "genre": "Fantasy",
        "plot": "Mindy adopts Angel, a high-spirited pony that—according to legend—will lead its owner to gold hidden in the nearby mountains. When Angel is kidnapped by a mad treasure hunter, Mindy and her school friends head into the hills to rescue the pony and hunt for the lost gold. But Mindy meets a mountain man that warns her the treasure is part of an ancient curse—if they remove the gold, they'll destroy the beautiful forest."
    },
    {
        "title": "Top Gun: Maverick",
        "genre": "Action",
        "plot": "After more than thirty years of service as one of the Navy’s top aviators, and dodging the advancement in rank that would ground him, Pete “Maverick” Mitchell finds himself training a detachment of TOP GUN graduates for a specialized mission the likes of which no living pilot has ever seen."
    },
    {
        "title": "The Hobbit: The Battle of the Five Armies",
        "genre": "Action",
        "plot": "Immediately after the events of The Desolation of Smaug, Bilbo and the dwarves try to defend Erebor's mountain of treasure from others who claim it: the men of the ruined Laketown and the elves of Mirkwood. Meanwhile an army of Orcs led by Azog the Defiler is marching on Erebor, fueled by the rise of the dark lord Sauron. Dwarves, elves and men must unite, and the hope for Middle-Earth falls into Bilbo's hands."
    },
    {
        "title": "The Champion",
        "genre": "Drama",
        "plot": "Diego has just been voted best young player in Europe and at the age of 20 he is on his way to making his team, Atlético de Madrid, champions of La Liga. But his impulsive and conflictive character makes the club, fed up with his excesses, hire Álex, a withdrawn and lonely psychology professor, to improve his behaviour. The two will have no choice but to learn to understand each other."
    },
    {
        "title": "Descendants 2",
        "genre": "Family",
        "plot": "When the pressure to be royal becomes too much for Mal, she returns to the Isle of the Lost where her archenemy Uma, Ursula's daughter, has taken her spot as self-proclaimed queen."
    },
    {
        "title": "Monsters vs Aliens",
        "genre": "Animation",
        "plot": "When Susan Murphy is unwittingly clobbered by a meteor full of outer space gunk on her wedding day, she mysteriously grows to 49-feet-11-inches. The military jumps into action and captures Susan, secreting her away to a covert government compound. She is renamed Ginormica and placed in confinement with a ragtag group of Monsters..."
    },
    {
        "title": "Despicable Me 2",
        "genre": "Animation",
        "plot": "Gru is recruited by the Anti-Villain League to help deal with a powerful new super criminal."
    },
    {
        "title": "Mean Girls",
        "genre": "Drama",
        "plot": "Cady Heron is a hit with The Plastics, the A-list girl clique at her new school, until she makes the mistake of falling for Aaron Samuels, the ex-boyfriend of alpha Plastic Regina George."
    },
    {
        "title": "Kingdom of Heaven",
        "genre": "Drama",
        "plot": "After his wife dies, a blacksmith named Balian is thrust into royalty, political intrigue and bloody holy wars during the Crusades."
    },
    {
        "title": "The Imaginary",
        "genre": "Animation",
        "plot": "Amanda and her imaginary friend Rudger go on thrilling make-believe adventures. But when Rudger finds himself alone, he faces a mysterious threat."
    },
    {
        "title": "Demon Slayer -Kimetsu no Yaiba- The Movie: Mugen Train",
        "genre": "Action",
        "plot": "Tanjiro Kamado, joined with Inosuke Hashibira, a boy raised by boars who wears a boar's head, and Zenitsu Agatsuma, a scared boy who reveals his true power when he sleeps, boards the Infinity Train on a new mission with the Fire Hashira, Kyojuro Rengoku, to defeat a demon who has been tormenting the people and killing the demon slayers who oppose it!"
    },
    {
        "title": "The Equalizer",
        "genre": "Thriller",
        "plot": "McCall believes he has put his mysterious past behind him and dedicated himself to beginning a new, quiet life. But when he meets Teri, a young girl under the control of ultra-violent Russian gangsters, he can’t stand idly by – he has to help her. Armed with hidden skills that allow him to serve vengeance against anyone who would brutalize the helpless, McCall comes out of his self-imposed retirement and finds his desire for justice reawakened. If someone has a problem, if the odds are stacked against them, if they have nowhere else to turn, McCall will help. He is The Equalizer."
    },
    {
        "title": "Concrete Utopia",
        "genre": "Thriller",
        "plot": "The world has been reduced to rubble by a massive earthquake. While no one knows for sure how far the ruins stretch, or what the cause of the earthquake may be, in the heart of Seoul there is only one apartment building left standing. It is called Hwang Gung Apartments. As time passes, outsiders start coming in to Hwang Gung Apartments trying to escape the extreme cold. Before long, the apartment residents are unable to cope with the increasing numbers. Feeling a threat to their very survival, the residents enact a special measure."
    },
    {
        "title": "Bad Boys II",
        "genre": "Action",
        "plot": "Detectives Marcus Burnett and Mike Lowrey of the Miami Narcotics Task Force are tasked with stopping the flow of the drug ecstasy into Miami. They track the drugs to the whacked-out Cuban drug lord Johnny Tapia, who is also involved in a bloody war with Russian and Haitian mobsters. If that isn't bad enough, there's tension between the two detectives when Marcus discovers that playboy Mike is secretly romancing Marcus’ sister, Syd."
    },
    {
        "title": "The Devil Wears Prada",
        "genre": "Drama",
        "plot": "Andy moves to New York to work in the fashion industry. Her boss is extremely demanding, cruel and won't let her succeed if she doesn't fit into the high class elegant look of their magazine."
    },
    {
        "title": "Am I OK?",
        "genre": "Drama",
        "plot": "Lucy and Jane have been best friends for most of their lives and think they know everything there is to know about each other. But when Jane announces she's moving to London, Lucy reveals a long-held secret. As Jane tries to help Lucy, their friendship is thrown into chaos."
    }
]